Revit 2027 API
BuiltInFailures.OffsetFacesCellLegacyFailures Class
 Failures related to offset faces operations.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.OffsetFacesCellLegacyFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class OffsetFacesCellLegacyFailures
Public NotInheritable Class OffsetFacesCellLegacyFailures
public ref class OffsetFacesCellLegacyFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type OffsetFacesCellLegacyFailures = class end
The BuiltInFailures.OffsetFacesCellLegacyFailures type exposes the following members.
Properties
Name | Description
OffsetFaceFailed
Top
See Also
Reference
Autodesk.Revit.DB Namespace